Project/Toir/src/DataProcessors/ГрупповаяОбработкаНоменклатурыКлассов/ГрупповаяОбработкаНоменклатурыКлассов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповаяОбработкаНоменклатурыКлассов</name>
  <tabularSections>
    <name>НоменклатураДляОбработки</name>
    <attributes>
      <name>НоменклатураКласса</name>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияГрупповойОбработки</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияГрупповогоРедактирования</types>
      </type>
    </attributes>
    <attributes>
      <name>АтрибутКласса</name>
      <type>
        <types>EnumRef.РеквизитыНоменклатурыКласса</types>
        <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>EnumRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/ЗначенияАтрибутовКласса/ЗначенияАтрибутовКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияАтрибутовКласса</name>
  <resources>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>Characteristic.АтрибутыКласса</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/ДействияГрупповогоРедактирования/ДействияГрупповогоРедактирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияГрупповогоРедактирования</name>
  <enumValues>
    <name>УстановитьРеквизит</name>
  </enumValues>
  <enumValues>
    <name>УстановитьАтрибут</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/РеквизитыНоменклатурыКласса/РеквизитыНоменклатурыКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РеквизитыНоменклатурыКласса</name>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Статус</name>
  </enumValues>
  <enumValues>
    <name>Класс</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/РежимыЗаполненияАтрибутов/РежимыЗаполненияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыЗаполненияАтрибутов</name>
  <enumValues>
    <name>ОбязательныйДляОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ОбязательныйДляНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбязательныйДляКласса</name>
  </enumValues>
  <enumValues>
    <name>ФиксированноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>Необязательный</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/РежимыИспользованияАтрибутов/РежимыИспользованияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыИспользованияАтрибутов</name>
  <enumValues>
    <name>БезОграничений</name>
  </enumValues>
  <enumValues>
    <name>ТолькоДляОбъектовНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/НоменклатураКласса/НоменклатураКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКласса</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитНоменклатуруКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТОиР</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/ГрупповаяОбработкаНоменклатурыКлассов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивНоменклатуры = Неопределено;
	Если Параметры.Свойство("НоменклатураДляОбработки", МассивНоменклатуры) Тогда
		Для Каждого НоменклатураСсылка ИЗ МассивНоменклатуры Цикл
			СтрокаТЧ = Объект.НоменклатураДляОбработки.Добавить();
			СтрокаТЧ.НоменклатураКласса = НоменклатураСсылка;
			СтрокаТЧ.Выбрано = Истина;
		КонецЦикла;
		
		ОбновитьДанныеАтрибутов();
	КонецЕсли;
	
	Если Объект.НоменклатураДляОбработки.Количество() > 0 Тогда
		Элементы.НоменклатураСписок.ТекущаяСтрока = Объект.НоменклатураДляОбработки[0].НоменклатураКласса;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействияГрупповойОбработки

&НаКлиенте
Процедура ДействияГрупповойОбработкиПриАктивизацииСтроки(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияГрупповойОбработкиДействиеПриИзменении(Элемент)
	
	УстановитьОграничениеТипаАтрибутаКласса();
	
	УстановитьОграничениеТипаЗначенияАтрибута();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияГрупповойОбработкиАтрибутКлассаПриИзменении(Элемент)
	
	УстановитьОграничениеТипаЗначенияАтрибута();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияГрупповойОбработкиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ДействияГрупповойОбработки.ТекущиеДанные;
	
	ОграничениеТипа = Элементы.ДействияГрупповойОбработкиЗначение.ОграничениеТипа;
	ТипВариантыЗначений = Тип("СправочникСсылка.ВариантыЗначенийАтрибутовКласса");
	ЭтоВариантыЗначений = ОграничениеТипа.СодержитТип(ТипВариантыЗначений);
	
	Если ЭтоВариантыЗначений Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОтбора = Новый Структура("Владелец", ТекСтрока.АтрибутКласса);
		
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
		
		ФормаВыбора = ПолучитьФорму("Справочник.ВариантыЗначенийАтрибутовКласса.ФормаВыбора", ПараметрыВыбора, Элемент, УникальныйИдентификатор);
		ФормаВыбора.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияГрупповойОбработкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ОбновитьДанныеАтрибутов();
	
	УстановитьОграничениеТипаАтрибутаКласса();
	
	УстановитьОграничениеТипаЗначенияАтрибута();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНоменклатураСписок

&НаКлиенте
Процедура НоменклатураСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавитьВыбраннуюНоменклатуру();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	ДобавитьВыбраннуюНоменклатуру();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНоменклатуру(Команда)
	
	МассивКУдалению = Новый Массив;
	Для Каждого ИДСтроки ИЗ Элементы.НоменклатураДляОбработки.ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект.НоменклатураДляОбработки.НайтиПоИдентификатору(ИДСтроки);
		МассивКУдалению.Добавить(СтрокаТЧ);
	КонецЦикла;
	
	Для Каждого СтрокаТЧ ИЗ МассивКУдалению Цикл
		Объект.НоменклатураДляОбработки.Удалить(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	Для Каждого СтрокаНоменклатуры ИЗ Объект.НоменклатураДляОбработки Цикл
		СтрокаНоменклатуры.Выбрано = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаНоменклатуры ИЗ Объект.НоменклатураДляОбработки Цикл
		СтрокаНоменклатуры.Выбрано = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьВыбраннуюНоменклатуру()
	
	СтруктураПоиска = Новый Структура("НоменклатураКласса");
	
	НоменклатураПризнакГруппы = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъектов(
		Элементы.НоменклатураСписок.ВыделенныеСтроки, "ЭтоГруппа");
	
	Для Каждого СтрокаНоменклатура ИЗ Элементы.НоменклатураСписок.ВыделенныеСтроки Цикл
		
		Если НоменклатураПризнакГруппы[СтрокаНоменклатура] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска.НоменклатураКласса = СтрокаНоменклатура;
		Найдено = Объект.НоменклатураДляОбработки.НайтиСтроки(СтруктураПоиска);
		Если Найдено.Количество() = 0 Тогда
			СтрокаОбработки = Объект.НоменклатураДляОбработки.Добавить();
			СтрокаОбработки.НоменклатураКласса = СтрокаНоменклатура;
			СтрокаОбработки.Выбрано = Истина;
			ТекСтрока = СтрокаОбработки;
		Иначе
			ТекСтрока = Найдено[0];
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		Элементы.НоменклатураДляОбработки.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаАтрибутаКласса()
	
	ТекСтрока = Элементы.ДействияГрупповойОбработки.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеУстановитьРеквизит = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоРедактирования.УстановитьРеквизит");
	ДействиеУстановитьАтрибут  = ПредопределенноеЗначение("Перечисление.ДействияГрупповогоРедактирования.УстановитьАтрибут");
	Если ТекСтрока.Действие = ДействиеУстановитьРеквизит Тогда
		ТипАтрибута = Новый ОписаниеТипов("ПеречислениеСсылка.РеквизитыНоменклатурыКласса");
		
		ЗначенияВыбора = Новый Массив;
		ЗначенияВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РеквизитыНоменклатурыКласса.Статус"));
		ЗначенияВыбора.Добавить(ПредопределенноеЗначение("Перечисление.РеквизитыНоменклатурыКласса.Класс"));
	ИначеЕсли ТекСтрока.Действие = ДействиеУстановитьАтрибут Тогда
		ТипАтрибута = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АтрибутыКласса");
		
		ЗначенияВыбора = Новый Массив;
		СтруктураПоиска = Новый Структура("Объект");
		Для Каждого ЭлементСписка ИЗ СписокАтрибутов Цикл
			ЗначенияВыбора.Добавить(ЭлементСписка.Значение);
		КонецЦикла;
	Иначе 
		Возврат;
	КонецЕсли;
	
	Элементы.ДействияГрупповойОбработкиАтрибутКласса.ОграничениеТипа = ТипАтрибута;
	Если НЕ ЗначенияВыбора = Неопределено Тогда
		СписокВыбора = Элементы.ДействияГрупповойОбработкиАтрибутКласса.СписокВыбора;
		СписокВыбора.ЗагрузитьЗначения(ЗначенияВыбора);
		Элементы.ДействияГрупповойОбработкиАтрибутКласса.РежимВыбораИзСписка = Истина;
	Иначе
		Элементы.ДействияГрупповойОбработкиАтрибутКласса.РежимВыбораИзСписка = Ложь;
	КонецЕсли;
	
	ТекСтрока.АтрибутКласса = ТипАтрибута.ПривестиЗначение(ТекСтрока.АтрибутКласса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОграничениеТипаАтрибута(АтрибутКласса)
	
	Если ТипЗнч(АтрибутКласса) = Тип("ПланВидовХарактеристикСсылка.АтрибутыКласса") Тогда
		Результат = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъекта(АтрибутКласса, "ТипЗначения");
	ИначеЕсли ТипЗнч(АтрибутКласса) = Тип("ПеречислениеСсылка.РеквизитыНоменклатурыКласса") Тогда
		МетаданныеРеквизита = Перечисления.РеквизитыНоменклатурыКласса.ПолучитьМетаданныеРеквизита(
			Метаданные.Справочники.НоменклатураКласса, АтрибутКласса);
		Результат = МетаданныеРеквизита.Тип;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОграничениеТипаЗначенияАтрибута()
	
	ТекСтрока = Элементы.ДействияГрупповойОбработки.ТекущиеДанные;
	Если ТекСтрока = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.Действие) 
			ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.АтрибутКласса) Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ПолучитьОграничениеТипаАтрибута(ТекСтрока.АтрибутКласса);
	Элементы.ДействияГрупповойОбработкиЗначение.ОграничениеТипа = ТипЗначения;
	ТекСтрока.Значение = ТипЗначения.ПривестиЗначение(ТекСтрока.Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНомнеклатуры(МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка,
		|	НоменклатураКласса.Класс,
		|	НоменклатураКласса.Код,
		|	НоменклатураКласса.Наименование,
		|	НоменклатураКласса.НомерПоСчетчику,
		|	НоменклатураКласса.ШагСчетчика,
		|	НоменклатураКласса.Класс.ШаблонНаименованияНоменклатуры КАК ШаблонНаименования
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Ссылка В(&МассивНоменклатуры)";
	Результат = Запрос.Выполнить().Выбрать();
	РеквизитыНомнеклатуры = Новый Соответствие;
	Пока Результат.Следующий() Цикл 
		СтруктураРеквизитов = Новый Структура("Класс, Код, Наименование, НомерПоСчетчику, ШагСчетчика, ШаблонНаименования");
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Результат);
		РеквизитыНомнеклатуры.Вставить(Результат.Ссылка, СтруктураРеквизитов);
	КонецЦикла;
	
	Возврат РеквизитыНомнеклатуры;
	
КонецФункции

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеАтрибутов();
	ВыбранаНоменклатура = Объект.НоменклатураДляОбработки.НайтиСтроки(Новый Структура("Выбрано", Истина));
	
	ЗаписаннаяНоменклатура = Новый Массив;
	МассивОбъектовВосстановитьНаследование = Новый Массив;
	СтруктураПоиска = Новый Структура("Объект, АтрибутКласса");
	
	// Действия с реквизитами номенклатуры.
	Для Каждого СтрокаНоменклатура ИЗ ВыбранаНоменклатура Цикл
		
		СпрОбъект = Неопределено;
		ОбновитьРодителя = Ложь;
		
		СтруктураПоиска.Объект = СтрокаНоменклатура.НоменклатураКласса;
		
		Для Каждого СтрокаДействия ИЗ Объект.ДействияГрупповойОбработки Цикл
			
			Если СтрокаДействия.Действие = Перечисления.ДействияГрупповогоРедактирования.УстановитьРеквизит Тогда
				
				Если СпрОбъект = Неопределено Тогда
					СпрОбъект = СтрокаНоменклатура.НоменклатураКласса.ПолучитьОбъект();
				КонецЕсли;
				
				МетаданныеРеквизита = Перечисления.РеквизитыНоменклатурыКласса.ПолучитьМетаданныеРеквизита(
					Метаданные.Справочники.НоменклатураКласса, СтрокаДействия.АтрибутКласса);
				СпрОбъект[МетаданныеРеквизита.Имя] = СтрокаДействия.Значение;
				
				Если СтрокаДействия.АтрибутКласса = Перечисления.РеквизитыНоменклатурыКласса.Класс Тогда
					ОбновитьРодителя = Истина;
				КонецЕсли;
			
			ИначеЕсли СтрокаДействия.Действие = Перечисления.ДействияГрупповогоРедактирования.УстановитьАтрибут Тогда
				
				СтруктураПоиска.АтрибутКласса = СтрокаДействия.АтрибутКласса;
				Найдено = ПоляАтрибутовКласса.НайтиСтроки(СтруктураПоиска);
				Если Найдено.Количество() > 0 Тогда
					Действие = "";
					// Если устанавливаемое значение отличается от записанного значения...
					Если (ЗначениеЗаполнено(СтрокаДействия.Значение) ИЛИ ЗначениеЗаполнено(Найдено[0].ЗначениеАтрибутаКласса))
							И НЕ СтрокаДействия.Значение = Найдено[0].ЗначениеАтрибутаКласса Тогда
						
						// Если устанавливаемое значение совпадает со значением по умолчанию, 
						// тогда удаляем запись из регистра значений атрибутов.
						Если (СтрокаДействия.Значение = Найдено[0].ЗначениеПоУмолчанию
								ИЛИ НЕ ЗначениеЗаполнено(СтрокаДействия.Значение) И НЕ ЗначениеЗаполнено(Найдено[0].ЗначениеПоУмолчанию)) Тогда
							Действие = "Удалить";
						Иначе
							Действие = "Записать";
						КонецЕсли;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Действие) Тогда
						Запись = РегистрыСведений.ЗначенияАтрибутовКласса.СоздатьМенеджерЗаписи();
						Запись.Класс = СтрокаНоменклатура.НоменклатураКласса;
						Запись.АтрибутКласса = СтрокаДействия.АтрибутКласса;
						Если Действие = "Записать" Тогда
							Запись.ЗначениеАтрибутаКласса = СтрокаДействия.Значение;
							Запись.Записать();
						ИначеЕсли Действие = "Удалить" Тогда
							Запись.Удалить();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Отказ = Ложь;
		Если НЕ СпрОбъект = Неопределено Тогда
			Если ОбновитьРодителя Тогда
				СпрОбъект.Родитель = Справочники.НоменклатураКласса.ПолучитьРодителяПоКлассу(СпрОбъект.Класс);
			КонецЕсли;
			СпрОбъект.Записать();
			МассивОбъектовВосстановитьНаследование.Добавить(СпрОбъект.Ссылка);
			ЗаписаннаяНоменклатура.Добавить(СтрокаНоменклатура.НоменклатураКласса);
		КонецЕсли;
		
		СтрокаНоменклатура.Выбрано = Ложь;
		
	КонецЦикла;
	
	Справочники.Классы.ВосстановитьНаследованиеТабЧастей(МассивОбъектовВосстановитьНаследование);
	
	ПоляАтрибутовКласса.Очистить();
	ОбновитьДанныеАтрибутов();
	
	ЗначенияРеквизитовНоменклатуры = ПолучитьДанныеНомнеклатуры(ЗаписаннаяНоменклатура);
	
	// Обновление наименований.
	Для Каждого НоменклатураКласса ИЗ ЗаписаннаяНоменклатура Цикл
		РеквизитыНоменклатуры = ЗначенияРеквизитовНоменклатуры[НоменклатураКласса];
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры.ШаблонНаименования) Тогда
			ТаблицаАтрибутов = ПоляАтрибутовКласса.Выгрузить(Новый Структура("Объект", НоменклатураКласса));
			СтруктураДляФормирования = Новый Структура("Класс, Код, Наименование");
			ЗаполнитьЗначенияСвойств(СтруктураДляФормирования, РеквизитыНоменклатуры);
			СтруктураДляФормирования.Вставить("ТаблицаАтрибутов", ТаблицаАтрибутов);
			СтруктураДляФормирования.Вставить("ПредставлениеОбъекта", Строка(НоменклатураКласса));
			НовоеНаименование = ШаблоныСтрокСервер.СформироватьЗначениеПоШаблону(
				СтруктураДляФормирования, РеквизитыНоменклатуры.ШаблонНаименования, 
				РеквизитыНоменклатуры.НомерПоСчетчику, РеквизитыНоменклатуры.ШагСчетчика, Отказ, Ложь);
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ РеквизитыНоменклатуры.Наименование = НовоеНаименование Тогда
				СпрОбъект = НоменклатураКласса.ПолучитьОбъект();
				СпрОбъект.Наименование = НовоеНаименование;
				СпрОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ СтрокаНоменклатура = Неопределено Тогда
		Элементы.НоменклатураСписок.ТекущаяСтрока = СтрокаНоменклатура.НоменклатураКласса;
	КонецЕсли;
	Элементы.НоменклатураСписок.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеАтрибутов()
	
	СтруктураПоиска = Новый Структура("Объект");
	МассивОбъектовДляЧтения = Новый Массив;
	
	Для Каждого СтрокаТЧ ИЗ Объект.НоменклатураДляОбработки Цикл
		СтруктураПоиска.Объект = СтрокаТЧ.НоменклатураКласса;
		Найдено = ПоляАтрибутовКласса.НайтиСтроки(СтруктураПоиска);
		Если Найдено.Количество() = 0 Тогда
			МассивОбъектовДляЧтения.Добавить(СтрокаТЧ.НоменклатураКласса);
		КонецЕсли;
	КонецЦикла;
	
	ТипСтрока = Тип("Строка");
	
	МассивАтрибутов = СписокАтрибутов.ВыгрузитьЗначения();
	МассивИзменен = Ложь;
	
	ТаблицаАтрибутов = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(МассивОбъектовДляЧтения,,, Ложь);
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		Если СтрокаТЗ.МножественноеЗначение И НЕ СтрокаТЗ.ТипЗначения.СодержитТип(ТипСтрока) 
				ИЛИ СтрокаТЗ.СтатусНаследования > 3
				ИЛИ СтрокаТЗ.РежимЗаполнения = Перечисления.РежимыЗаполненияАтрибутов.ОбязательныйДляКласса
				ИЛИ СтрокаТЗ.РежимИспользования = Перечисления.РежимыИспользованияАтрибутов.ТолькоДляОбъектовНоменклатуры Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДанных = ПоляАтрибутовКласса.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаТЗ);
		Если МассивАтрибутов.Найти(СтрокаТЗ.АтрибутКласса) = Неопределено Тогда
			МассивАтрибутов.Добавить(СтрокаТЗ.АтрибутКласса);
			МассивИзменен = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИзменен Тогда
		СписокАтрибутов.ЗагрузитьЗначения(МассивАтрибутов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Раздел «Обработчики событий формы» содержит процедуры-обработчики событий формы: ПриСозданииНаСервере, ПриОткрытии и т.п.
// Раздел «Обработчики событий элементов шапки формы» содержит процедуры-обработчики элементов, расположенных в основной части формы (все, что не связано с таблицами на форме).
// В разделах «Обработчики событий элементов таблицы формы <имя таблицы формы>» размещаются процедуры-обработчики таблиц формы и элементов таблиц. 
// Для процедур-обработчиков каждой таблицы должен быть создан свой раздел.
// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы (имена которых задаются в свойстве Действие команд формы).
// Раздел «Служебные процедуры и функции» имеет такое же предназначение, что и в общих модулях.
